Revit 2027 API
ElementIntersectsSolidFilter(Solid) Constructor
 Constructs a filter to match elements which intersect the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementIntersectsSolidFilter(
	Solid solid
)
Public Sub New (
	solid As Solid
)
public:
ElementIntersectsSolidFilter(
	Solid^ solid
)
new :
        solid : Solid -> ElementIntersectsSolidFilter
Parameters
solid Solid
 The solid geometry to check for intersection.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementIntersectsSolidFilter Class
ElementIntersectsSolidFilter Overload
Autodesk.Revit.DB Namespace